In [ ]:
import pandas as pd

In [ ]:
Beijing_NO2 = pd.read_csv('Beijing_2021-06-29_CN01-N1.csv')
Dhaka_CO2 = pd.read_csv('Dhaka_2021-06-29_BD01-N2.csv')
NewYork_NO2 = pd.read_csv('New York_2021-06-28_US01-N1.csv')
NewYork_CO2 = pd.read_csv('New York_2021-06-29_US01-N2.csv')
San_Francisco_NO2 = pd.read_csv('San Francisco_2021-06-29_US03-N1.csv')

In [ ]:
Beijing_NO2 = Beijing_NO2.assign(indicatorValue='NO2 Emission Beijing')
Dhaka_CO2 = Dhaka_CO2.assign(indicatorValue='CO2 Emission Dhaka')
NewYork_NO2 = NewYork_NO2.assign(indicatorValue='NO2 Emission New York')
NewYork_CO2 = NewYork_CO2.assign(indicatorValue='CO2 Emission New York')
San_Francisco_NO2 = San_Francisco_NO2.assign(indicatorValue='NO2 Emission San Francisco')

list_data = [Beijing_NO2, Dhaka_CO2, NewYork_NO2, NewYork_CO2]

[                        time  ...                inputData
0   2018-05-07T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
1   2018-05-21T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
2   2018-06-04T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
3   2018-06-18T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
4   2018-07-02T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
..                       ...  ...                      ...
76  2021-04-05T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
77  2021-04-19T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
78  2021-05-03T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
79  2021-05-17T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
80  2021-05-31T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2

[81 rows x 9 columns],                         time                 aoi  ...  colorCode   inputData
0   2016-04-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...       BLUE         NaN
1   2017-01-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...       BLUE         NaN
2   2017-02-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...       BLUE         NaN
3   2017-03-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...       BLUE         NaN
4   2017-04-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...       BLUE         NaN
5   2018-01-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...       BLUE         NaN
6   2018-02-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...       BLUE         NaN
7   2018-03-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...       BLUE         NaN
8   2018-04-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...       BLUE         NaN
9   2019-01-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...       BLUE  GOSAT_XCO2
10  2019-02-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...       BLUE  GOSAT_XCO2
11  2019-03-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...       BLUE  GOSAT_XCO2
12  2019-04-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...       BLUE  GOSAT_XCO2
13  2020-01-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...      GREEN  GOSAT_XCO2
14  2020-02-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...      GREEN  GOSAT_XCO2
15  2020-03-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...      GREEN  GOSAT_XCO2
16  2020-04-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...      GREEN  GOSAT_XCO2

[17 rows x 9 columns],                         time  ...                inputData
0   2018-05-07T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
1   2018-05-21T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
2   2018-06-04T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
3   2018-06-18T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
4   2018-07-02T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
..                       ...  ...                      ...
76  2021-04-05T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
77  2021-04-19T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
78  2021-05-03T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
79  2021-05-17T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
80  2021-05-31T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2

[81 rows x 9 columns],                         time  ...   inputData
0   2016-04-01T00:00:00.000Z  ...         NaN
1   2017-01-01T00:00:00.000Z  ...         NaN
2   2017-02-01T00:00:00.000Z  ...         NaN
3   2017-03-01T00:00:00.000Z  ...         NaN
4   2017-04-01T00:00:00.000Z  ...         NaN
5   2018-01-01T00:00:00.000Z  ...         NaN
6   2018-03-01T00:00:00.000Z  ...         NaN
7   2018-04-01T00:00:00.000Z  ...         NaN
8   2019-01-01T00:00:00.000Z  ...  GOSAT_XCO2
9   2019-02-01T00:00:00.000Z  ...  GOSAT_XCO2
10  2019-03-01T00:00:00.000Z  ...  GOSAT_XCO2
11  2019-04-01T00:00:00.000Z  ...  GOSAT_XCO2
12  2020-01-01T00:00:00.000Z  ...  GOSAT_XCO2
13  2020-02-01T00:00:00.000Z  ...  GOSAT_XCO2
14  2020-03-01T00:00:00.000Z  ...  GOSAT_XCO2

[15 rows x 9 columns]]

In [ ]:
display(Beijing_NO2.head())
display(Dhaka_CO2.head())
display(NewYork_NO2.head())
display(NewYork_CO2.head())
display(San_Francisco_NO2.head())

                       time  ...                inputData
0  2018-05-07T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
1  2018-05-21T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
2  2018-06-04T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
3  2018-06-18T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
4  2018-07-02T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2

[5 rows x 9 columns]

                       time                 aoi  ...  colorCode inputData
0  2016-04-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...       BLUE       NaN
1  2017-01-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...       BLUE       NaN
2  2017-02-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...       BLUE       NaN
3  2017-03-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...       BLUE       NaN
4  2017-04-01T00:00:00.000Z  LatLng(23.8, 90.3)  ...       BLUE       NaN

[5 rows x 9 columns]

                       time  ...                inputData
0  2018-05-07T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
1  2018-05-21T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
2  2018-06-04T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
3  2018-06-18T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
4  2018-07-02T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2

[5 rows x 9 columns]

                       time                           aoi  ...  colorCode inputData
0  2016-04-01T00:00:00.000Z  LatLng(40.71268, -74.005812)  ...       BLUE       NaN
1  2017-01-01T00:00:00.000Z  LatLng(40.71268, -74.005812)  ...       BLUE       NaN
2  2017-02-01T00:00:00.000Z  LatLng(40.71268, -74.005812)  ...       BLUE       NaN
3  2017-03-01T00:00:00.000Z  LatLng(40.71268, -74.005812)  ...       BLUE       NaN
4  2017-04-01T00:00:00.000Z  LatLng(40.71268, -74.005812)  ...       BLUE       NaN

[5 rows x 9 columns]

                       time  ...                inputData
0  2018-05-07T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
1  2018-05-21T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
2  2018-06-04T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
3  2018-06-18T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2
4  2018-07-02T00:00:00.000Z  ...  Sentinel-5p Level-3 NO2

[5 rows x 9 columns]

In [ ]:
#cols = ["Date","indicatorValue","City","Value"]
resulted_df = pd.DataFrame(columns=["Date","indicatorValue","City","Measurement"])

In [ ]:
import re
def return_df(df):
  new_df = pd.DataFrame(columns=["Date","indicatorValue","City","Measurement"])

  for x in range(0,len(df)):
    date = re.search("^(.+)T.+", df['time'][x])
    date = date.group(1)

    city = re.search("^.+ Emission (.+)$", df['indicatorValue'][x])
    city = city.group(1)

    indicatorValue = df['indicatorValue'][x]
    measurement = df['measurement'][x]

    tempdf = pd.DataFrame({"Date": [date], 'indicatorValue': [indicatorValue], 'City': [city], 'Measurement': [measurement]})
    new_df = new_df.append(tempdf,ignore_index=True)

  return new_df

for df in list_data:
  returned_df = return_df(df)
  resulted_df = resulted_df.append(returned_df, ignore_index=True)

print(resulted_df)

           Date         indicatorValue      City  Measurement
0    2018-05-07   NO2 Emission Beijing   Beijing    194.21602
1    2018-05-21   NO2 Emission Beijing   Beijing    143.73322
2    2018-06-04   NO2 Emission Beijing   Beijing    133.34633
3    2018-06-18   NO2 Emission Beijing   Beijing    130.20685
4    2018-07-02   NO2 Emission Beijing   Beijing    151.91910
..          ...                    ...       ...          ...
383  2019-03-01  CO2 Emission New York  New York     -7.64000
384  2019-04-01  CO2 Emission New York  New York      3.85000
385  2020-01-01  CO2 Emission New York  New York      5.50000
386  2020-02-01  CO2 Emission New York  New York      4.50000
387  2020-03-01  CO2 Emission New York  New York      4.44000

[388 rows x 4 columns]

In [ ]:
display(new_df)

Empty DataFrame
Columns: [Date, indicatorValue, City, Measurement]
Index: []

In [ ]:
Beijing_NO2 = ['time','indicatorValue','Value']
Beijing_NO2

['time', 'indicatorValue', 'Value']

In [ ]:
df = pd.read_csv('https://plotly.github.io/datasets/country_indicators.csv')

In [ ]:
display (df)
df.to_csv('test.csv')

,Country Name,Indicator Name,Year,Value
0,Arab World,"Agriculture, value added (% of GDP)",1962,NaN
1,Arab World,CO2 emissions (metric tons per capita),1962,0.760996
2,Arab World,Domestic credit provided by financial sector (...,1962,18.168690
3,Arab World,Electric power consumption (kWh per capita),1962,NaN
4,Arab World,Energy use (kg of oil equivalent per capita),1962,NaN
...,...,...,...,...
36955,Zimbabwe,"Industry, value added (% of GDP)",2007,33.074953
36956,Zimbabwe,"Inflation, GDP deflator (annual %)",2007,0.894887
36957,Zimbabwe,"Life expectancy at birth, total (years)",2007,44.177756
36958,Zimbabwe,Population density (people per sq. km of land ...,2007,34.374559
36959,Zimbabwe,"Services, etc., value added (% of GDP)",2007,45.327139